select replace([Полный номер],'/'+substring(docs.[Примечание],1,charindex(' за декабрь 2023',docs.[Примечание])-2)+'-2023','-2023'),*
from stack.[Документ] docs 
where docs.[Тип документа] =1 and docs.[Дата]='2023-12-01' and docs.[Срок]='2023-12-25' and [Документы-Договор] in (select row_id from stack.[Договор] where Грузополучатель in (select row_id from stack.[Организации] where [Бюджет]=1));

-- небюджетники
update stack.[Документ] 
set [Полный номер] = replace([Полный номер],'/'+substring([Примечание],1,charindex(' за декабрь 2023',[Примечание])-2)+'-2023','/40-2023'), [Примечание]='40% за декабрь 2023' 
where 
		[Тип документа] =1 
	and [Дата]='2023-12-01' 
	and [Срок]='2023-12-25' 
	and [Документы-Договор] not in (select row_id from stack.[Договор] where Грузополучатель in (select row_id from stack.[Организации] where [Бюджет]=1))
;


-- небюджетники ФСК
update stack.[Документ] 
set [Полный номер] = replace([Полный номер],'/'+substring([Примечание],1,charindex(' за декабрь 2023',[Примечание])-2)+'-2023','/40-2023'), [Примечание]='40% за декабрь 2023' 
where [Тип документа] =1 
	and [Дата]='2023-12-01' 
	and [Срок]='2023-12-25' 
	and [Документы-Договор] not in (select row_id from stack.[Договор] where Грузополучатель in (select row_id from stack.[Организации] where [Бюджет]=1))
	AND [Документы-Договор] in (select row_id from stack.[Договор] where Номер IN (1920866090, 1920866060, 1920866040, 1920866030, 1920853040, 1920851410, 1920455070, 1920453450, 1920453370, 1920452950, 1920164720, 1920153200, 1920153140, 1920151710, 1911341020, 1911244650, 1911215440, 1911211050, 1911144590, 1911139180, 1910924920, 1910915460, 1910645170, 1910237487, 1910227197, 1910226300, 1910224840, 1910223730, 1910217607, 1910217065, 1910215830))
;




-- бюджетники
update stack.[Документ] 
set [Полный номер] = replace([Полный номер],'/'+substring([Примечание],1,charindex(' за декабрь 2023',[Примечание])-2)+'-2023','-2023'), [Примечание]='40% за декабрь 2023' 
where [Тип документа] =1 
	and [Дата]='2023-12-01' 
	and [Срок]='2023-12-25' 
	and [Документы-Договор] in (select row_id from stack.[Договор] where Грузополучатель in (select row_id from stack.[Организации] where [Бюджет]=1)) 
;


-- бюджетники ФСК
update stack.[Документ] 
set [Полный номер] = replace([Полный номер],'/'+substring([Примечание],1,charindex(' за декабрь 2023',[Примечание])-2)+'-2023','-2023'), [Примечание]='40% за декабрь 2023' 
where [Тип документа] =1 
	and [Дата]='2023-12-01' 
	and [Срок]='2023-12-25' 
	and [Документы-Договор] in (select row_id from stack.[Договор] where Грузополучатель in (select row_id from stack.[Организации] where [Бюджет]=1)) 
	AND [Документы-Договор] in (select row_id from stack.[Договор] where Номер IN (1920866090, 1920866060, 1920866040, 1920866030, 1920853040, 1920851410, 1920455070, 1920453450, 1920453370, 1920452950, 1920164720, 1920153200, 1920153140, 1920151710, 1911341020, 1911244650, 1911215440, 1911211050, 1911144590, 1911139180, 1910924920, 1910915460, 1910645170, 1910237487, 1910227197, 1910226300, 1910224840, 1910223730, 1910217607, 1910217065, 1910215830))
;

-- сетевые
update stack.[Документ] 
set [Полный номер] = replace([Полный номер],'/'+substring([Примечание],1,charindex(' за декабрь 2023',[Примечание])-2)+'-2023','/40-2023'), [Примечание]='40% за декабрь 2023' 
where [Тип документа] =1 and [Дата]='2023-12-01' and [Срок]='2023-12-25' and [Документы-Договор] in (114103, 116582, 112925);


select * from stack.[Документ] where [Документы-Договор] =  116602 and [Тип документа]=1 ;


-- договора бюджетники
select Номер from stack.[Договор] where Грузополучатель in (select row_id from stack.[Организации] where [Бюджет]=1);

-- бекап графиков оплаты 2023 11
CREATE TABLE atom_khk_ul.dbo.[График оплаты договора 202311] (
	ROW_ID int NOT NULL,
	Месяц datetime NULL,
	[Сумма платежа] float NULL,
	дополнительнаяСумма float NULL,
	дополнительныйОбъем1 float NULL,
	дополнительныйОбъем2 float NULL,
	[График-Договор] int DEFAULT -1 NULL,
	[День платежа] int NULL,
	[Месяц платежа] int NULL,
	[Тип графика] tinyint NULL,
	процентДоговорнойВеличины int NULL,
	процентСуммы int NULL,
	[График-Услуга] int DEFAULT -1 NULL,
	МесяцПо datetime NULL
);
insert into atom_khk_ul.dbo.[График оплаты договора 202311] (ROW_ID, Месяц, [Сумма платежа], дополнительнаяСумма, дополнительныйОбъем1, дополнительныйОбъем2, [График-Договор], [День платежа], [Месяц платежа], [Тип графика], процентДоговорнойВеличины, процентСуммы, [График-Услуга], МесяцПо)
select ROW_ID, Месяц, [Сумма платежа], дополнительнаяСумма, дополнительныйОбъем1, дополнительныйОбъем2, [График-Договор], [День платежа], [Месяц платежа], [Тип графика], процентДоговорнойВеличины, процентСуммы, [График-Услуга], МесяцПо 
from atom_khk_ul.stack.[График оплаты договора];
-------------------------------