---------------------------------------------------------------------------------------------------
-------          идентификатор, что тут фигурирует - это документ реализации, группирующий с/ф и прочие документы в один пакет
---------------------------------------------------------------------------------------------------

select *
	from stack.[ЭДО Документ]
	where 		[ЭДО Документ-Документ] in (select row_id from stack.[Документ] where 30565195 in (row_id, [Платеж-Выписка]));
-- в этой таблице, у выбранных выше записей потребно очистить поля [ИД] и [ИД пакета, иначе триггер не дает удалять
---------------------------------------------------------------------------------------------------


SELECT *
FROM atom_khk_ul.stack.[ЭДО Состояние]
where [ЭДО Состояние-ЭДО Документ] in (
select row_id
	from stack.[ЭДО Документ]
	where [ЭДО Документ-Документ] in (select row_id from stack.[Документ] where 30565195 in (row_id, [Платеж-Выписка]))
);

-----------------------------------------------------------------------------------------------------
